Felixrising/ESP32_nRF52_SWD/src/web.cpp
/*
   Copyright (c) 2021 Aaron Christophel ATCnetz.de
   SPDX-License-Identifier: GPL-3.0-or-later
*/
#include <Arduino.h>
#include <FS.h>
#include <LittleFS.h>
#include <ESPmDNS.h>
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <SPIFFSEditor.h>
#include <LoopbackStream.h>

#include "web.h"
#include "nrf_swd.h"
#include "glitcher.h"
#include "defines.h"

const char* ssid = "REPLACE_WITH_YOUR_WIFI_SSID";
const char* password = "REPLACE_WITH_YOUR_WIFI_PASSWORD";

const char *http_username = "admin";
const char *http_password = "admin";
AsyncWebServer server(80);

unsigned long hstol(String recv)
{
  char c[recv.length() + 1];
  recv.toCharArray(c, recv.length() + 1);
  return strtoul(c, NULL, 16);
}

byte nibble(char c)
{
  if (c >= '0' && c <= '9')
    return c - '0';

  if (c >= 'a' && c <= 'f')
    return c - 'a' + 10;

  if (c >= 'A' && c <= 'F')
    return c - 'A' + 10;

  return 0;
}

int decode_line(byte *buf, String line)
{
  int data_len = nibble(line[1]) * 16 + nibble(line[2]);
  int line_len = data_len + 5;

  if (line.length() < line_len * 2 + 1)
  {
    return -1;
  }

  for (int i = 0; i < line_len; i++)
  {
    buf[i] = nibble(line[1 + i * 2]) * 16 + nibble(line[2 + i * 2]);
  }

  byte csum = 0;
  for (int i = 0; i < line_len; i++)
  {
    csum += buf[i];
  }
  if (csum)
  { // should be 0
    return -2;
  }
  return 0;
}

void init_web()
{
  Serial.print("hostname: ");
  Serial.println(WiFi.getHostname());

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  Serial.printf("Connecting to WiFi %s\r\n", ssid);
  while (WiFi.status() != WL_CONNECTED)
  {
    Serial.print('.');
    delay(1000);
  }
  Serial.print("Connected! IP address: ");
  Serial.println(WiFi.localIP());

  // Make accessible via http://swd.local using mDNS responder
  if (!MDNS.begin("swd"))
  {
    while (1)
    {
      Serial.println("Error setting up mDNS responder!");
      delay(1000);
    }
  }
  Serial.println("mDNS responder started");
  MDNS.addService("http", "tcp", 80);
  LittleFS.begin(true);

  server.addHandler(new SPIFFSEditor(LittleFS, http_username, http_password));

  server.on("/heap", HTTP_GET, [](AsyncWebServerRequest *request)
            { request->send(200, "text/plain", String(ESP.getFreeHeap())); });

#define xstr(a) str(a)
#define str(a) #a

  server.on("/pins", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    String answer_state =
    "GPIO " xstr(LED) "\t: (internal)LED\n"
    "GPIO " xstr(swd_clock_pin) "\t: nRF52 SWDCLK pin\n"
    "GPIO " xstr(swd_data_pin) "\t: nRF52 SWDIO pin\n"
    "GPIO " xstr(GLITCHER) "\t: to gate of N-mosfet\n"
    "GPIO " xstr(NRF_POWER) "\t: nRF52 3.3V, VDD pin\n"
    "GPIO " xstr(OSCI_PIN) "\t: ADC pin for internal oscilloscope\n";
    request->send(200, "text/plain", answer_state); });

  server.on("/_reset_wifi_", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    if(!WiFi.disconnect(true, true))
      request->send(200, "text/plain", "WiFi disconnect failed");
    else
      ESP.restart(); });

  server.on("/get_state", HTTP_GET, [](AsyncWebServerRequest *request)
            {
              String new_cmd = "";
              if (request->hasParam("cmd"))
              {
                new_cmd = request->getParam("cmd")->value();
              }
              String answer_state = "";
              uint8_t percent = 0;
              if (new_cmd == "1")
                set_new_main_info(false);
              else if (new_cmd == "2")
                set_new_main_info(true);
              if (get_new_main_info())
              {
                nrf_info_struct nrf_ufcr;
                get_new_main_info(&nrf_ufcr);
                answer_state += ";info;";
                answer_state += String(nrf_ufcr.connected) + ";";
                answer_state += String(nrf_ufcr.flash_size) + ";";
                answer_state += String(nrf_ufcr.config_id) + ";";
                answer_state += String(nrf_ufcr.device_id0) + ";";
                answer_state += String(nrf_ufcr.device_id1) + ";";
                answer_state += String(nrf_ufcr.info_part) + ";";
                answer_state += String(nrf_ufcr.info_variant) + ";";
                answer_state += String(nrf_ufcr.info_package) + ";";
                answer_state += String(LittleFS.totalBytes()) + ";";
                answer_state += String(LittleFS.usedBytes()) + ";";
                answer_state += String(LittleFS.totalBytes() - LittleFS.usedBytes()) + ";";
                answer_state += String(nrf_ufcr.sd_info_area) + ";";
                answer_state += String(nrf_ufcr.ucir_lock) + ";";
              }
              else if (get_glitcher())
              {
                answer_state += "Glitcher running";
                answer_state += " Delay: " + String(get_delay());
                answer_state += " Width: " + String(get_width());
              }
              else if (get_task_flash(&percent))
              {
                answer_state += "Flash state ";
                answer_state += String(percent) + "%";
              }
              else
              {
                answer_state += "no task running, last speed " + String(get_last_speed()) + "kbps";
              }
              request->send(200, "text/plain", answer_state); });

  server.on("/set_delay", HTTP_POST, [](AsyncWebServerRequest *request)
            {
              if (request->hasParam("delay") && request->hasParam("delay_end") && request->hasParam("power_off") && request->hasParam("swd_wait"))
              {
                int new_delay = request->getParam("delay")->value().toInt();
                int new_delay_end = request->getParam("delay_end")->value().toInt();
                int new_power_off = request->getParam("power_off")->value().toInt();
                int new_swd_wait = request->getParam("swd_wait")->value().toInt();
                request->send(200, "text/plain", "Ok set delay: " + String(new_delay) + " delay_end: " + String(new_delay_end));
                set_delay(new_delay, new_delay_end, new_power_off, new_swd_wait);
                return;
              }
              request->send(200, "text/plain", "Wrong parameter"); });

  server.on("/set_swd", HTTP_POST, [](AsyncWebServerRequest *request)
            {
              if (get_glitcher())
              {
                request->send(200, "text/plain", "ERROR Glitcher is running");
                return;
              }

              if (request->hasParam("cmd"))
              {
                String swd_cmd = request->getParam("cmd")->value();
                String answer = "";

                if (swd_cmd == "init")
                {
                  char init_string[100] = {0};
                  sprintf(init_string, "Init of SWD ID: 0x%08x", nrf_begin());
                  answer = init_string;
                }
                else if (swd_cmd == "power_on")
                {
                  set_power(HIGH);
                  answer = "Power on";
                }
                else if (swd_cmd == "power_off")
                {
                  set_power(LOW);
                  answer = "Power off";
                }
                else
                {

                  if (is_nrf_connected() == 0)
                  {
                    request->send(200, "text/plain", "ERROR nRF not connected");
                    return;
                  }

                  if (swd_cmd == "set_reset")
                  {
                    nrf_soft_reset();
                    answer = "Ok reset";
                  }
                  else if (swd_cmd == "erase_all")
                  {
                    nrf_erase_all();
                    answer = "nRF erased";
                  }
                  else if (is_nrf_connected() == 1)
                  {
                    request->send(200, "text/plain", "ERROR nRF is locked");
                    return;
                  }
                  else if (swd_cmd == "lock_state")
                  {
                    answer = "the nRF is " + String(nrf_read_lock_state() ? "unlocked" : "locked");
                  }
                  else if (swd_cmd == "set_lock")
                  {
                    write_flash(0x10001208, 0x00);
                    nrf_soft_reset();
                    nrf_begin();
                    answer = "the nRF is now " + String(nrf_read_lock_state() ? "unlocked" : "locked");
                  }
                  else if (swd_cmd == "read_register")
                  {
                    String read_address = "";
                    if (request->hasParam("address"))
                      read_address = request->getParam("address")->value();
                    char read_flash_string[100] = {0};
                    sprintf(read_flash_string, "Register read address: 0x%08x value: 0x%08x", (unsigned int)hstol(read_address), read_register(hstol(read_address)));
                    answer = read_flash_string;
                  }
                  else if (swd_cmd == "write_register")
                  {
                    String write_address = "";
                    String write_value = "";
                    if (request->hasParam("address") && request->hasParam("value"))
                    {
                      write_address = request->getParam("address")->value();
                      write_value = request->getParam("value")->value();
                    }
                    else
                    {
                      request->send(200, "text/plain", "Wrong parameter");
                      return;
                    }
                    write_register(hstol(write_address), hstol(write_value));
                    answer = "Register write address: 0x" + String(write_address) + " value: 0x" + String(write_value);
                  }
                  else if (swd_cmd == "write_flash")
                  {
                    String write_address = "";
                    String write_value = "";
                    if (request->hasParam("address") && request->hasParam("value"))
                    {
                      write_address = request->getParam("address")->value();
                      write_value = request->getParam("value")->value();
                    }
                    else
                    {
                      request->send(200, "text/plain", "Wrong parameter");
                      return;
                    }
                    write_flash(hstol(write_address), hstol(write_value));
                    answer = "Flash write address: 0x" + String(write_address) + " value: 0x" + String(write_value);
                  }
                  else
                  {
                    request->send(200, "text/plain", "Wrong parameter");
                    return;
                  }
                }
                request->send(200, "text/plain", "Ok: " + String(answer));
                return;
              }
              request->send(200, "text/plain", "Wrong parameter"); });

  server.on("/flash_cmd", HTTP_POST, [](AsyncWebServerRequest *request)
            {
              if (get_glitcher())
              {
                request->send(200, "text/plain", "ERROR Glitcher is running");
                return;
              }
              if (is_nrf_connected() == 0)
              {
                request->send(200, "text/plain", "ERROR nRF not connected");
                return;
              }
              else if (is_nrf_connected() == 1)
              {
                request->send(200, "text/plain", "ERROR nRF is locked");
                return;
              }

              if (request->hasParam("cmd"))
              {
                String swd_cmd = request->getParam("cmd")->value();
                String answer = "";

                if (swd_cmd == "erase_all")
                {
                  erase_flash();
                  answer = "Everything erased";
                }
                else if (swd_cmd == "page_erase")
                {
                  String write_address = "";
                  if (request->hasParam("address"))
                  {
                    write_address = request->getParam("address")->value();
                  }
                  else
                  {
                    request->send(200, "text/plain", "Wrong parameter");
                    return;
                  }
                  erase_page(hstol(write_address));
                  answer = "Page erased: 0x" + String(write_address);
                }
                else if (swd_cmd == "flash_file")
                {
                  String filename = "";
                  uint32_t offset = 0;
                  if (request->hasParam("file"))
                  {
                    filename = request->getParam("file")->value();
                  }
                  else
                  {
                    request->send(200, "text/plain", "Wrong parameter");
                    return;
                  }
                  if (!LittleFS.exists("/" + filename))
                  {
                    request->send(200, "text/plain", "Error opening file");
                    return;
                  }

                  if (request->hasParam("offset"))
                  {
                    offset = hstol(request->getParam("offset")->value());
                  }

                  set_write_flash(offset, "/" + filename);
                  answer = "file flash task created";
                }
                else if (swd_cmd == "dump_flash")
                {
                  String filename = "";
                  uint32_t offset = 0;
                  uint32_t size = 0;
                  if (request->hasParam("file") && request->hasParam("offset") && request->hasParam("size"))
                  {
                    filename = request->getParam("file")->value();
                    offset = hstol(request->getParam("offset")->value());
                    size = hstol(request->getParam("size")->value());
                  }
                  else
                  {
                    request->send(200, "text/plain", "Wrong parameter");
                    return;
                  }
                  if (size > (LittleFS.totalBytes() - LittleFS.usedBytes()))
                  {
                    request->send(200, "text/plain", "Not enough free space on the ESP32");
                    return;
                  }
                  set_read_flash(offset, size, "/" + filename);
                  answer = "file read task created";
                }
                else
                {
                  request->send(200, "text/plain", "Wrong parameter");
                  return;
                }
                request->send(200, "text/plain", "Ok: " + String(answer));
                return;
              }
              request->send(200, "text/plain", "Wrong parameter"); });

  server.on("/set_glitcher", HTTP_POST, [](AsyncWebServerRequest *request)
            {
              if (request->hasParam("state"))
              {
                String new_state = request->getParam("state")->value();
                if (new_state == "1")
                {
                  request->send(200, "text/plain", "Ok set glitcher: 1");
                  set_glitcher(1);
                }
                else if (new_state == "0")
                {
                  request->send(200, "text/plain", "Ok set glitcher: 0");
                  set_glitcher(0);
                }
                else if (new_state == "dump_full_flash")
                {

                  if (get_glitcher())
                  {
                    request->send(200, "text/plain", "ERROR Glitcher is running");
                    return;
                  }
                  if (is_nrf_connected() == 0)
                  {
                    request->send(200, "text/plain", "ERROR nRF not connected");
                    return;
                  }
                  else if (is_nrf_connected() == 1)
                  {
                    request->send(200, "text/plain", "ERROR nRF is locked");
                    return;
                  }

                  nrf_info_struct nrf_ufcr;
                  get_new_main_info(&nrf_ufcr);

                  if (nrf_ufcr.flash_size > (LittleFS.totalBytes() - LittleFS.usedBytes()))
                  {
                    request->send(200, "text/plain", "Not enough free space on the ESP32");
                    return;
                  }

